Masmiseim36/nxpSDK/boards/frdmk22f_agm01/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MK22FN512xxx12
package_id: MK22FN512VLH12
mcu_data: ksdk2_0
processor_version: 4.0.0
board: FRDM-K22F
kit: FRDM-K22F-AGM01
pin_labels:
- {pin_num: '26', pin_signal: PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, label: 'SH_U1[9]/SH_J4[3]/SH_INT2_8700/J1[10]/LLWU_P3', identifier: ACCEL1_INT2}
- {pin_num: '37', pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, label: 'SH_J6[3]/SH_U1[4]/SH_U2[11]/SH_J3[4]/SH_I2C_SCL1/SH_SCL1_SCLK/J24[12]/U8[4]/U18[28]/I2C0_SCL',
  identifier: ACCEL1_I2C_S1_SCL;ACCEL2_I2C_S1_SCL;I2C_BB_SCL}
- {pin_num: '38', pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, label: 'SH_J7[3]/SH_U1[6]/SH_U2[12]/SH_J3[5]/SH_I2C_SDA1/SH_SDA1_MOSI/J24[10]/U8[6]/U18[27]/I2C0_SDA',
  identifier: ACCEL1_I2C_S1_SDA;ACCEL2_I2C_S1_SDA;I2C_BB_SDA}
- {pin_num: '39', pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/EWM_IN, label: 'SH_U1[11]/SH_J4[1]/SH_INT1_8700/J1[6]/J8[G1]/SD_CARD_DETECT', identifier: ACCEL1_INT1;SD_CARD_DETECT}
- {pin_num: '41', pin_signal: PTB18/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/FTM2_QD_PHA, label: 'SH_J4[8]/SH_U2[3]/SH_INT1_21002/J1[12]', identifier: ACCEL2_INT1}
- {pin_num: '42', pin_signal: PTB19/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB, label: 'SH_U2[2]/SH_J4[9]/SH_INT2_21002/J2[2]', identifier: ACCEL2_INT2}
- {pin_num: '44', pin_signal: ADC0_SE15/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FB_AD13/I2S0_TXD0/LPUART0_RTS_b, label: 'J24[6]/LLWU_P6/PUSH_BUTTON2', identifier: SW2}
- {pin_num: '45', pin_signal: ADC0_SE4b/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FB_AD12/I2S0_TX_FS/LPUART0_CTS_b, label: 'SH_J5[1]/SH_RST_21002/SH_U3[2]/SH_U2[4]/SH_J4[7]/J24[8]',
  identifier: RST_21002}
- {pin_num: '61', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FB_AD2/EWM_IN/SPI1_PCS0, label: 'SH_J3[8]/SH_U2[17]/J2[6]/J6[4]/LLWU_P14', identifier: RF_CS}
- {pin_num: '62', pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/FTM0_CH5/FB_AD1/EWM_OUT_b/SPI1_SCK, label: 'J2[12]/BLUE_LED', identifier: LEDRGB_BLUE}
- {pin_num: '63', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT, label: 'J2[8]'}
- {pin_num: '64', pin_signal: PTD7/UART0_TX/FTM0_CH7/FTM0_FLT1/SPI1_SIN, label: 'J2[10]'}
- {pin_num: '1', pin_signal: ADC1_SE4a/PTE0/CLKOUT32K/SPI1_PCS1/UART1_TX/I2C1_SDA/RTC_CLKOUT, label: 'SH_J7[1]/SH_U1[6]/SH_U2[12]/SH_J3[5]/SH_I2C_SDA0/SH_SDA1_MOSI/J2[18]/UART1_RX_TGTMCU',
  identifier: ACCEL1_I2C_S2_SDA;ACCEL2_I2C_S2_SDA;DEBUG_UART_TX}
- {pin_num: '2', pin_signal: ADC1_SE5a/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/I2C1_SCL/SPI1_SIN, label: 'SH_J6[1]/SH_U1[4]/SH_U2[11]/SH_J3[4]/SH_I2C_SCL0/SH_SCL1_SCLK/J2[20]/J6[1]/UART1_TX_TGTMCU',
  identifier: ACCEL1_I2C_S2_SCL;ACCEL2_I2C_S2_SCL;DEBUG_UART_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SHIELD_InitAccel1I2C1Pins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '26', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, direction: INPUT, slew_rate: slow, open_drain: disable,
    pull_select: down, pull_enable: disable, passive_filter: disable}
  - {pin_num: '39', peripheral: GPIOB, signal: 'GPIO, 16', pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/EWM_IN, identifier: ACCEL1_INT1, direction: INPUT,
    slew_rate: slow, open_drain: disable, pull_select: down, pull_enable: disable}
  - {pin_num: '37', peripheral: I2C0, signal: SCL, pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, identifier: ACCEL1_I2C_S1_SCL, slew_rate: fast, open_drain: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: '38', peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, identifier: ACCEL1_I2C_S1_SDA, slew_rate: fast, open_drain: enable,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SHIELD_InitAccel1I2C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SHIELD_InitAccel1I2C1Pins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t ACCEL1_INT2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 26)  */
    GPIO_PinInit(BOARD_ACCEL1_INT2_GPIO, BOARD_ACCEL1_INT2_PIN, &ACCEL1_INT2_config);

    gpio_pin_config_t ACCEL1_INT1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB16 (pin 39)  */
    GPIO_PinInit(BOARD_ACCEL1_INT1_GPIO, BOARD_ACCEL1_INT1_PIN, &ACCEL1_INT1_config);

    const port_pin_config_t ACCEL1_INT2 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Slow slew rate is configured */
                                           kPORT_SlowSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as PTA4 */
                                           kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTA4 (pin 26) is configured as PTA4 */
    PORT_SetPinConfig(BOARD_ACCEL1_INT2_PORT, BOARD_ACCEL1_INT2_PIN, &ACCEL1_INT2);

