Masmiseim36/nxpSDK/boards/frdmk22f_agm01/project_template/pin_mux.c
    const port_pin_config_t ACCEL1_INT1 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Slow slew rate is configured */
                                           kPORT_SlowSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as PTB16 */
                                           kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTB16 (pin 39) is configured as PTB16 */
    PORT_SetPinConfig(BOARD_ACCEL1_INT1_PORT, BOARD_ACCEL1_INT1_PIN, &ACCEL1_INT1);

    const port_pin_config_t ACCEL1_I2C_S1_SCL = {/* Internal pull-up resistor is enabled */
                                                 kPORT_PullUp,
                                                 /* Fast slew rate is configured */
                                                 kPORT_FastSlewRate,
                                                 /* Passive filter is disabled */
                                                 kPORT_PassiveFilterDisable,
                                                 /* Open drain is enabled */
                                                 kPORT_OpenDrainEnable,
                                                 /* Low drive strength is configured */
                                                 kPORT_LowDriveStrength,
                                                 /* Pin is configured as I2C0_SCL */
                                                 kPORT_MuxAlt2,
                                                 /* Pin Control Register fields [15:0] are not locked */
                                                 kPORT_UnlockRegister};
    /* PORTB2 (pin 37) is configured as I2C0_SCL */
    PORT_SetPinConfig(BOARD_ACCEL1_I2C_S1_SCL_PORT, BOARD_ACCEL1_I2C_S1_SCL_PIN, &ACCEL1_I2C_S1_SCL);

    const port_pin_config_t ACCEL1_I2C_S1_SDA = {/* Internal pull-up resistor is enabled */
                                                 kPORT_PullUp,
                                                 /* Fast slew rate is configured */
                                                 kPORT_FastSlewRate,
                                                 /* Passive filter is disabled */
                                                 kPORT_PassiveFilterDisable,
                                                 /* Open drain is enabled */
                                                 kPORT_OpenDrainEnable,
                                                 /* Low drive strength is configured */
                                                 kPORT_LowDriveStrength,
                                                 /* Pin is configured as I2C0_SDA */
                                                 kPORT_MuxAlt2,
                                                 /* Pin Control Register fields [15:0] are not locked */
                                                 kPORT_UnlockRegister};
    /* PORTB3 (pin 38) is configured as I2C0_SDA */
    PORT_SetPinConfig(BOARD_ACCEL1_I2C_S1_SDA_PORT, BOARD_ACCEL1_I2C_S1_SDA_PIN, &ACCEL1_I2C_S1_SDA);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SHIELD_InitAccel2I2C1Pins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '41', peripheral: GPIOB, signal: 'GPIO, 18', pin_signal: PTB18/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/FTM2_QD_PHA, direction: INPUT, slew_rate: slow, open_drain: disable,
    pull_select: down, pull_enable: disable}
  - {pin_num: '42', peripheral: GPIOB, signal: 'GPIO, 19', pin_signal: PTB19/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB, direction: INPUT, slew_rate: slow, open_drain: disable,
    pull_select: down, pull_enable: disable}
  - {pin_num: '37', peripheral: I2C0, signal: SCL, pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, identifier: ACCEL2_I2C_S1_SCL, slew_rate: fast, open_drain: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: '38', peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, identifier: ACCEL2_I2C_S1_SDA, slew_rate: fast, open_drain: enable,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SHIELD_InitAccel2I2C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SHIELD_InitAccel2I2C1Pins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t ACCEL2_INT1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 41)  */
    GPIO_PinInit(BOARD_ACCEL2_INT1_GPIO, BOARD_ACCEL2_INT1_PIN, &ACCEL2_INT1_config);

    gpio_pin_config_t ACCEL2_INT2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 42)  */
    GPIO_PinInit(BOARD_ACCEL2_INT2_GPIO, BOARD_ACCEL2_INT2_PIN, &ACCEL2_INT2_config);

    const port_pin_config_t ACCEL2_INT1 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Slow slew rate is configured */
                                           kPORT_SlowSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as PTB18 */
                                           kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTB18 (pin 41) is configured as PTB18 */
    PORT_SetPinConfig(BOARD_ACCEL2_INT1_PORT, BOARD_ACCEL2_INT1_PIN, &ACCEL2_INT1);

    const port_pin_config_t ACCEL2_INT2 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Slow slew rate is configured */
                                           kPORT_SlowSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as PTB19 */
                                           kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTB19 (pin 42) is configured as PTB19 */
    PORT_SetPinConfig(BOARD_ACCEL2_INT2_PORT, BOARD_ACCEL2_INT2_PIN, &ACCEL2_INT2);

    const port_pin_config_t ACCEL2_I2C_S1_SCL = {/* Internal pull-up resistor is enabled */
                                                 kPORT_PullUp,
                                                 /* Fast slew rate is configured */
                                                 kPORT_FastSlewRate,
                                                 /* Passive filter is disabled */
                                                 kPORT_PassiveFilterDisable,
                                                 /* Open drain is enabled */
                                                 kPORT_OpenDrainEnable,
                                                 /* Low drive strength is configured */
                                                 kPORT_LowDriveStrength,
                                                 /* Pin is configured as I2C0_SCL */
                                                 kPORT_MuxAlt2,
                                                 /* Pin Control Register fields [15:0] are not locked */
                                                 kPORT_UnlockRegister};
    /* PORTB2 (pin 37) is configured as I2C0_SCL */
    PORT_SetPinConfig(BOARD_ACCEL2_I2C_S1_SCL_PORT, BOARD_ACCEL2_I2C_S1_SCL_PIN, &ACCEL2_I2C_S1_SCL);

    const port_pin_config_t ACCEL2_I2C_S1_SDA = {/* Internal pull-up resistor is enabled */
                                                 kPORT_PullUp,
                                                 /* Fast slew rate is configured */
                                                 kPORT_FastSlewRate,
                                                 /* Passive filter is disabled */
                                                 kPORT_PassiveFilterDisable,
                                                 /* Open drain is enabled */
                                                 kPORT_OpenDrainEnable,
                                                 /* Low drive strength is configured */
                                                 kPORT_LowDriveStrength,
                                                 /* Pin is configured as I2C0_SDA */
                                                 kPORT_MuxAlt2,
                                                 /* Pin Control Register fields [15:0] are not locked */
                                                 kPORT_UnlockRegister};
    /* PORTB3 (pin 38) is configured as I2C0_SDA */
    PORT_SetPinConfig(BOARD_ACCEL2_I2C_S1_SDA_PORT, BOARD_ACCEL2_I2C_S1_SDA_PIN, &ACCEL2_I2C_S1_SDA);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

